app/Controllers/PostController.php

SELECT *
FROM `articletable`
---
    public function allpost()
    {

        $db = \Config\Database::connect();

        $query = $db->table('articletable')
            ->select('articletable.*,languageName')

            ->join('languagetable', 'articletable.language_id = languagetable.id', 'left')
            ->get();
        $data = $query->getResultArray();